import random

'''
訂單生成的限制條件
從內部任意挑選
'''
Type = ['A', 'B']
operatorDictA = {
    'op1' : ['110'],
    'op2' : ['120'],
    'op3' : ['130', '135'],
    'op4' : ['140', '145'],
    'op5' : ['150', '155'],
    'op6' : ['160']
}
operatorDictB = {
    'op1' : '110',
    'op2' : '120',
    'op3' : '130',
    'op4' : '140',
    'op5' : '150',
    'op6' : '160'
}
processTime = {
    "110" : 22,
    "120" : 36,
    "130" : 6,
    "135" : 6,
    "140" : 27,
    "145" : 6,
    "150" : 57,
    "155" : 6,
    "160" : 30  
}
baseMoney = 10000
moneyRange = {
    '4': [5,15],
    '5': [15,25],
    '6': [25,35]
}

serial_num = 1
op_num = random.randint(4,6)
